9/data/attachments/a5a901efa0a798b4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_033d585e-c0e3-460d-a752-926cb5fb8ca7</nif:username>
            <nif:friendToBeAdded>Jo_establish_Friend_93547_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>